{"0":{"0":["January 30, 2021: ","Windows 7/XP version of Plazma Burst 2 standalone launcher is able to load custom maps and custom decorations now; Fixed problem related to some songs not playing, also added more hints for Level Editor's error reporting mode regarding song problems.<br>"],"1":["January 14, 2021: ","Linux version of Plazma Burst 2 launcher has been added and <a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"https://www.plazmaburst2.com/pb2/linux_download.html\" target=\"_blank\">you can get it from here</a>. So far we only tested it with Ubuntu 20.10<br>"],"2":["January 9, 2021: ","Fixed custom song genre guessing error.<br>"],"3":["January 5, 2021: ","Fixed bug that was preventing some teammates from being revived on approved maps in COOP mode.<br>"],"4":["December 30, 2020: ","Small server update - ping limit change will only be available for match owners and site staff.<br>"],"5":["December 19, 2020: ","Few small changes:<br><br>- Game will no longer ignore first click in multiplayer mode if game window was defocused;<br>- [ Restart ] button at in-game Esc menu will always re-download map if Map ID starts with current login.<br>"],"6":["November 19th, 2020","Hello Marines,<br><br>It's November and we are coming close to the end of the year, unfortunately after December 31st we will lose Support to Flash Player in browsers. Every browser will be removing Flash Player support after December 31st.<br><br>What this means, Plazma Burst is run & supported by Flash. Flash will no longer run / work along with PB2 in web browsers, as PB2 is coded in Flash.<br><br>There is a solution, the Plazma Burst Standalone Launcher! <br><br>Install the Launcher by clicking this link <a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"https://www.plazmaburst2.com/pb2/Plazma%20Burst%202.zip\">Click this Link</a><br><br>If you are a Mac User <a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"https://www.plazmaburst2.com/pb2/mac_download.html\">Click This Link</a><br><br><a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"https://www.plazmaburst2.com/forum/viewtopic.php?f=126&t=25098&p=215623#p215623\">Click this Link to be taken to the forum post regarding the Launcher</a><br><br>The launcher will allow you to play Plazma Burst 2 & PB:FTTP from your PC. It improves game's performance in most cases too!<br><br>If you have any problems making the launcher work, please let us know ASAP <a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"https://www.plazmaburst2.com/support/\">Contact us via the Ticket System!</a><br><br>Thankfully, PB3 will not require Flash Player to play. ( We are guessing it will be available to play via browser, but we will have to wait and see when it gets released )<br><br><br><br>If you have any questions, please reach out to the Site Management. We will do our best to provide help and answers. Reach out via Twitter, Inbox message, Discord, Forum post or Inbox or the Ticket System.<br><br>Thank you for understanding! We are sorry for any inconvenience.<br><br>~ The Plazma Burst Team<br><br>"]},"1":{"0":["November 11, 2020: ","URL request trigger action in Level Editor is now able to notify remote servers about users in guest mode; Fixed problem with URL request trigger action not working.<br>"],"1":["October 25, 2020: ","New 8 trigger action types were added to Level Editor.<br>"],"2":["October 4, 2020: ","Attention Marines!<br><br>We are testing new standalone version of Plazma Burst 2 (which does not require web browser, this one is Windows only).<br><br>As usually, it is available at the bottom of \"<a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"https://www.plazmaburst2.com/?s=2&a=\">Play</a>\" (alongside with instructions for other platforms) section or by following this link: <br><a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"https://www.plazmaburst2.com/pb2/Plazma%20Burst%202.zip\">Plazma Burst 2.zip</a><br><br>Features:<br>- Standalone launcher;<br>- Automatic & manual updating;<br>- Experience rewards should be available in standalone version too;<br>- Campaign progress as well as settings will be stored at your profile once you authenticate at launcher (optional) now;<br>- Other than that, launcher is mostly just a Plazma Burst 2 logo and News list. Perhaps it will be more eventually?<br><br>Change log (October 7, 2020):<br>- Fixed issue when launcher would not start (was silently crashing) for some users;<br>- Edit profile page and logo link will no longer open old version of Internet Explorer but would instead use system default browser.<br><br>Change log (October 8, 2020):<br>- Partial support for Windows 7 was added.<br><br>Change log (October 25, 2020):<br>- Hidden PB:FTTP start link.<br>- Maximized launcher window will result into game being maximized on start as well.<br>- Launcher application won't appear as running once game started."],"3":["July 15, 2020: ","Attention Marines!<br><br>We have made necessary changes to our Code of Conduct. In addition, we have posted information about Map Approval Requirements & Custom Decoration Guidelines.<br><br><a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"https://www.plazmaburst2.com/forum/viewtopic.php?f=116&t=21471#p194381\">Click this link to be taken to the Code of Conduct</a><br><br><a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"https://www.plazmaburst2.com/forum/viewtopic.php?f=116&t=24538&p=211998#p211998\">Click this link to be taken to the Map Approval Requirements</a><br><br><a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"https://www.plazmaburst2.com/forum/viewtopic.php?f=116&t=24537#p211996\">Click this link to be taken to the Custom Decoration Guidelines</a><br><br>Please take the time to read through them if you're not familiar.<br><br>If you have any questions or comments, please reach out to any of the Site Administrators.<br><br>Thank you!"],"4":["June 29, 2020: ","Attention Marines!<br><br>Expect website to work slower from time to time - backup maintenance is being done. In order for website to remain responsible while this happens - backup will be done in multiple small portions."],"5":["May 5, 2020: ","Attention Marines!<br><br>Level Editors League Season 4 !!!! <br><br>Come join, make some awesome maps!!<br><br><a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"https://www.plazmaburst2.com/forum/viewtopic.php?f=173&t=24115\">Click this link to be taken to the post</a>"],"6":["May 2, 2020: ","Attention Marines!<br><br>Servers will prevent fast reconnect in ranked matches. Also last damage dealt to leaving players within 7 seconds will be seen by server as elimination (including few seconds past player's disconnection while his character still appears half-transparent in game) now.<br><br>"]},"2":{"0":["April 28, 2020: ","Attention Marines!<br><br>Map rotation functionality added. It won't affect availability of approved maps for ranked modes but will increase maximum Skill Points players will be able to keep if they will play these maps more (it will be done by increasing bonus Skill Points given for each elimination on these maps).<br><br>Approved maps within rotation are highlighted with different color and will be automatically chosen when match is started with random Map ID.<br>Full list of maps within current rotation can be seen at the top of <a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"/?a=&s=7&ac=www.PlazmaBurst2.com&id=663495\">this</a> page (or by clicking at website logo).<br><br>Currently map rotation is done in manual way by our map approval team - expect changes and more details soon!"],"1":["April 22, 2020: ","Attention Marines!<br><br>Servers will support maps with more level logic now (fixed issue where some maps would never load in Multiplayer mode but would work normally in Singleplayer mode). Added stat tracking (recent play time, recent eliminations and recent map completion due to experience reward trigger action activation) for custom map players if they'll left any review or comment at map's page."],"2":["March 30, 2020: ","Attention Marines!<br><br>Game has been updated (slight netcode update that includes some of desynchronization fixes as well as newer hit detection model where player limbs get circular hitbox instead of rectangular while in-between frame states are handled more accurately)."],"3":["March 25, 2020: ","Attention Marines!<br><br> Plazma League will be holding a 3v3 Exhibition Match! If you would like a chance to participate in the Exhibition match and the Spring Tournament, sign up here.<br><br><a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"https://forms.gle/i9mfupFtNsZeVW8H9\">Click this link to be taken to the Sign Up Page</a>!<br><br><a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"https://discord.gg/2PXYT7F\">Click this link to be taken to the PL Discord</a>!"],"4":["January 30, 2020: ","Attention Marines!<br><br>This is our first post in 2020!! Happy new years to everyone, happy year of the mouse!<br><br>Multiplayer servers from now on will apply different kind of automatic bans for cursing, with warning. Bans are 7 days for guests and 2 days for registered users. If a guest user receives a 7 day ban you can re-login into your account for it to be automatically decreased.<br><br>Whenever muted player joins match:<br>- You'll be able to chat normally in X days Y hours Z minutes W seconds.<br><br>The Auto ban system was updated to be more forgiving and fair when it comes to cursing in-game.<br><br>We also added a server feature for staff. The Server wide Announcement feature. Everyone in a match will receive a message when something is announced. Many of you have already seen this. We have been hosting mini-events for you all to enjoy and it seems it's gotten positive feedback, we will be sure to continue to keep running events for you!  <br><br>Thank you for reading!<br><br>~ The Plazma Burst Staff<br><br>We would really appreicate feedback on our mini events<br><a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"http://plazmaburst2.com/forum/viewtopic.php?f=146&t=23775&p=207262#p207262\">Click this link to be taken to the post</a>"],"5":["December 31, 2019: ","Attention Marines!<br><br> Happy New Year to you!!!<br><br>I personally wanted to thank everyone for another great year! Wanted to thank the team for their hard work and Eric for his help and continued work :)<br><br>It's nice to still see some players from 2011 when Plazma Burst First came out. I can remember joining PB2 back then and being asked to help Moderate the site chat :slight_smile: (Good old days <3) - Shadoww<br><br>We had some great staff members join the team and we wish them well!<br><br>We have had a lot of great memories and a lot of great clans be created such as the 101st , Boz , Delta Force and many more. Everyone from the PB2 team wanted to thank each and one of you for your support, feedback, fanart and just logging in each day and playing with us <3<br><br>---- <br><br>Honorable mentions; GSA and EKAT, Itami, Dark Clan, GeNo, USF, SET, YrN <br><br>---- <br><br>I hope to continue seeing you all for many more years and don't be shy, send us a Private message or @ us to play with you or ask us a question :)<br><br>Okay, I could keep on writing for days.... So from me personally Thank you for being awesome and sticking around and for our new players welcome!<br><br>We love you all <3<br><br>~ The Plazma Burst Staff<br><br>Ps.<br><br>If you haven't already..... Check out our twitter https://twitter.com/PlazmaBurstTeam (And if you look above you can see some spoilers of PB2.5 Enjoy!)<br><br>"],"6":["December 13, 2019: ","Attention Marines!<br><br> Multiplayer servers are temporarily merged into one that seems to be more reliable through these days. We will switch back to 2 multiplayer servers when performance issues will be solved.<br><br>Update: Both servers are live now.<br><br>"]},"3":{"0":["November 14, 2019: "," Game was updated to v1.33 which includes some of important multiplayer bug fixes related to inaccurate game state representation in spectating mode, shield grenade bugs and occasional lag spikes in multiplayer."],"1":["November 5, 2019: "," Greetings players!<br><br>We wanted to do a mini advertisement for all our new players and players who may not know.<br><br>If you're interested in Plazma Burst lore, weapon stats or \"how to\" be sure to check out our <a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"https://plazmaburst.miraheze.org/wiki/Main_Page\">Official Wiki Page</a>. It has a lot of information for you! We are also looking for Wiki Editors, please register on the wiki to help us out!<br><br>Join our <a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"https://www.plazmaburst2.com/forum/index.php\">Forum</a> discussion and let us know if you have any bugs, ideas or awesome Fan-Art / Game-play Clips to share!<br><br> The <a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"https://discordapp.com/invite/Bhe9rNz\">Official Plazma Burst Discord Server</a> is the best way to interact with the community and site staff. Come talk about the Advanced Level Editor and your map, talk to other community members & join our Discord Events that are hosted weekly. Participating & winning rewards Level Exp!<br><br> Finally follow us on <a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"https://twitter.com/PlazmaBurstTeam\">Twitter</a>, we will tweet any information or if there are server / website problems. We also tweet spoilers...<br><br>Thank you!<br><br>The Plazma Burst Team"],"2":["October 10, 2019: "," Greetings players!<br><br>PB2 Game Version 1.32 is now Live! <br><br>Read the patch notes <a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"https://www.plazmaburst2.com/forum/viewtopic.php?f=116&t=23246#p204349\">here</a>.<br><br>We wanted to say thank you to everyone who participated in making this event & to our Artists / Voice Actors!<br><br>We are still waiting on a few voice actors to send us some files... This means once we get these we will update the game again with a few more voices for our characters!<br><br>Thank you!<br><br>The Plazma Burst Team"],"3":["August 29, 2019: "," Greetings players!<br><br>We wanted to inform everyone we updated our reporting system. Please use the report tool to report anyone for rude, inappropriate behavior, impersonation or anything that would violate our <a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"https://www.plazmaburst2.com/forum/viewtopic.php?f=116&t=21471#p194381\">Code of Conduct</a> !<br><br>Please note that reports that are pointless or frequent reports that do not violate the <a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"https://www.plazmaburst2.com/forum/viewtopic.php?f=116&t=21471#p194381\">Code of Conduct</a> !<br> can result in a warning or temporary 1 - 24 hour ban.<br><br>Reporting a Site Staff member -- Reporting a Site Moderator should be directly reported the Administration; <br><a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"https://www.plazmaburst2.com/?a=&s=7&ac=Eric%20Gurt&id=5\">Eric Gurt</a><br><a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"https://www.plazmaburst2.com/?a=&s=7&ac=Tempus&id=631637\">Tempus</a><br><a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"https://www.plazmaburst2.com/?a=&s=7&ac=Doomzerker&id=210571\">Doomzerker</a><br><a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"https://www.plazmaburst2.com/?a=&s=7&ac=Kiriakos%20Gr96&id=766386\">Kiriakos Gr96</a><br><br>Reporting An Administration member -- Directly report to <a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"https://www.plazmaburst2.com/?a=&s=7&ac=Eric%20Gurt&id=5\">Eric Gurt</a><br><br>Thank you!"],"4":["August 14, 2019: "," Greetings players!<br><br>We're excited to announce the seventh set of Fan Art Submissions! Thank you for sticking with us and we'd like to once again congratulate the following players whose work will be added to the game:<br><br>Skins: Vulture by darkstar 1, Silk by darkstar 1, Civil Riot by eru_, Japanese school girl by darkstar 1 & Generic civilian by mrnat444 (other civilian skins are in the works)<br><br>Weapons: Auto shotgun by darkstar 1, Phanx 150 - Bison by darkstar, Focus Beam by ditzy, C9 grenade launcher by darkstar 1, Explosive launcher by darkstar 1, Revolver by boom5, Scavenger Shotgun by thetoppestkek, Railgun by darkstar 1, Acid grenade launcher by lazyrain, Plasma SMG by lazyrain, android railgun by Roxxar, Alien railgun by darkstar 1<br><br>Thank you all for participating. If your work was accepted, please wait to be messaged on Discord or site inbox.<br><br>Wanted to mention to all our Fan-Artists please submit more artwork <a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"https://www.plazmaburst2.com/forum/viewtopic.php?f=146&t=23086#p203607\">Here</a> !<br>The forum topic is intended to be an Open Topic, which means there is no rush, no event active. Just submit your work and in the far future we might create another event for submissions.<br><br>Thank you!"],"5":["August 5, 2019: "," Greetings players!<br><br>We're excited to announce the sixth set of Fan Art Submissions. Thank you for sticking with us and we'd like to once again congratulate the following players whose work will be added to the game:<br><br>Skins: Crossfire Soldier (F) by ditzy, BattleSuit M-5 by CakeSpider.<br>Decorations: Medium potted tree & Small potted tree by darkstar 1.<br>Weapons: [removed], CS-IK by Ditzy, PH-01 by Phsc.<br><br>Thank you all for participating. If your work was accepted, please wait to be messaged on Discord or site inbox."],"6":["August 2, 2019: "," Greetings players!<br><br>We're excited to announce the fifth set of Fan Art Submissions. From now on, we will announce two skins instead of one in each wave. Thank you for sticking with us and we'd like to once again congratulate the following players whose work will be added to the game:<br><br>Skins: Rogue mining android by darkstar 1, Crossfire Soldier (M) v2 by Ditzy.<br>Decorations: Storage Locker by Doomzerker, Ceiling camera by darkstar 1.<br>Weapons: M202 by darkstar 1, Plasma Shotgun by phsc, White Rifle by phsc.<br><br>Thank you all for participating. If your work was accepted, please wait to be messaged on Discord or site inbox.<br><br>"]},"4":{"0":["July 31, 2019: "," Greetings players!<br><br>We hope you're all exited for the announcement of our fourth set of Fan-Art submissions! We wanted to thank you all who took part in the contest and congratulations to the following users with getting their work added into Plazma Burst:<br><br>Skin: Hexagon suit by darkstar 1.<br>Decorations: weapon crate by darkstar 1, Portable fission chamber by darkstar 1.<br>Weapons: Healing pistol by LazyRain, Gravy rocket launcher by LazyRain, CS-GLHF by Incompetence (replaces CS-RCu by Incompetence since similar weapon was added).<br><br>We wanted to take this time to also mention that we have polished a few approved maps / working on going though all of the approved maps and getting them up-to-date with our restrictions for approval -- Keep an eye out for new approved maps!<br><br>We have all been hard at work for you and from all of us we wanted to say thank you for playing Plazma Burst and we hope you like these updates! Please give us <a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"https://www.plazmaburst2.com/forum/viewtopic.php?f=146&t=23049#p203404\">FeedBack</a> !<br><br>Also follow us on <a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"https://twitter.com/PlazmaBurstTeam\">Twitter</a> !"],"1":["July 30, 2019: "," Greetings players!<br><br>We'd like to announce the third set of Fan-Art submissions! Thank you once again to all who took part in the contest and congratulations to the following users to getting their work added:<br><br>Skin: Hermes by darkstar 1.<br>Decorations: V2 of XXF Rapier by DoomWrath, Supply crate by darkstar 1.<br>Guns: CS-AUG by phsc, Raider Railgun Mk1 by ctxranger, Archetype 27XX by Incompetence.<br><br>Please make sure to respond to any messages sent to inbox if your work has been accepted."],"2":["July 27, 2019: "," Greetings players!<br><br>Thank you for reading our news post! We wanted to announce the next set of Fan-Art that will be added to Plazma Burst.<br><br>Skin: VPN (renamed to Zephyr) by ditzy.<br>Decorations: Holograms by darkstar 1, healing kit by darkstar 1.<br>Guns: Nexxon Shotgun NS-97 by thetoppestkek, armor piercing rifle by darkstar 1 and CR-30 by Incompetence.<br><br>If your name is posted here congratulations, please visit your inbox for a message from an Administrator. Thank you!"],"3":["July 26, 2019: "," Greetings players!<br><br>We wanted to congratulate & thank everyone who participated in our Fan Art Contest! We had a lot of submissions, specifically weapon submissions! Sadly not everything can get added (at least not yet!) However, what will be added you can read about it here.<br><br>Skin: ditzy (Android DT-148).<br>Guns: (Android sniper, Crossfire CR-145 Vortex and Psi cutter) by Mr jaks nes, ctxranger and LazyRain. <br>Decorations: (flag banners and camera) by ditzy and darkstar 1.<br><br>We will contact these players through site inbox or Discord shortly!!!<br><br>We will add more submissions soon!"],"4":["July 18, 2019: "," Greetings Plazma League players!<br><br>We wanted to congratulate everyone participating in <a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"https://www.plazmaburst2.com/forum/viewtopic.php?f=173&t=22986#p203041\">.: Level Editors League Season 1 :.</a> We had some awesome submissions, well done everyone! (we are still working out rewards, possibly it will be a profile title)<br><br>Additionally, we are working on a new event for you to participate in very soon. If you would like to participate in Plazma Burst Events, Click <a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"https://discord.gg/2PXYT7F\">this</a> link!<br><br>I wanted to take a moment to mention we are looking for Plazma League Staff Members. These are players who want to participate in creating events, judging events and helping make League better & more efficient. These members are not Plazma Burst Staff, please don't get confused. Some requirements I wanted to mention before you click on the link;<br><br>• Members who are Mature and Responsible.<br>• Have been apart of Plazma Burst and know the series well. ( Optional / But Preferred )<br>• Must have held a Plazma Burst account for at least 3 months.<br><br>If you are still interested please click <a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"/forum/viewtopic.php?f=174&t=22494#p200093\">this</a> link."],"5":["July 17, 2019: "," Greetings Artists, Level Editors & Players!<br><br>If you are unaware, we have opened a FanArt Submissions Event for you to create your own artwork and submit it for a chance to be thrown into Plazma Burst!<br><br>Submit your works <a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"/forum/viewtopic.php?f=146&p=203053\">here</a>.<br><br>Please note that more Fan-Art Submissions will be added to our Poll page. So be sure to check it daily! As an artist, please don't feel rushed. Create your fan-art and submit it, your work will be added to our poll as said previously. If you have any questions feel free to Contact Eric Gurt or Tempus. You can find them in our Contact Tab.<br><br><a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"/fanart.php\">Click here be taken to our Voting Poll for Fan-Art Submissions</a><br><br>Thank you and have a great day!"],"6":["July 14, 2019: "," Support for songs from Newgrounds.com as well as looping has been added to Advanced Level Editor.<br><br>"]},"5":{"0":["April 24, 2019: "," We invite all players who enjoy creating maps to join us in our <a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"https://www.plazmaburst2.com/forum/viewtopic.php?f=173&t=22773&p=201943#p201943\">Level Editors League Season 1</a> competition! Follow us on <a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"https://twitter.com/PlazmaBurstTeam\">twitter</a> for updates and information!"],"1":["April 15, 2019: "," We have developed a Site Ticket System that can be found on our <a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"https://www.plazmaburst2.com/?s=5&a=\">Contact</a> tab when on our website. We will try to respond as soon as we can. More information can be found <a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"https://www.plazmaburst2.com/forum/viewtopic.php?f=116&t=22749\">here</a>. <br>If you experience any bugs or malfunctions please report it on our forum <a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"https://www.plazmaburst2.com/forum/viewtopic.php?f=122&t=22769\">here</a>.<br>Thank you! ~ The Plazma Burst Team"],"2":["31 March 2019: "," Game (v1.31) & website update - for the most part it adds Custom Map previews and fixes minor game bugs. It is also possible to save game state as text (just in case if you are switching between online and offline version of the game). Level completion time is no longer affected by Time Warp (in fact, Time Warp can become counter-productive in case of speedrun)."],"3":["17 February 2019: "," Game has been updated. New trigger action types (text placeholder, decorations scaling, decoration color multiplier, movable-to-movable attachment, decoration-to-movable attachment, background-to-movable attachment, possibility for level logic to know exact power of projectile that did inflict damage to Movable), fixed doors moving too fast for short period of time when playing with high latency, fixed problem when decorations were flooding glowing parts during model change, fixed problem with Movables receiving damage twice."],"4":["5 September 2018: "," Game has been updated. New trigger action types (such as ones that allow character scaling, variable synchronization and custom music playback in Custom Maps) were added to Advanced Level Editor of Plazma Burst 2. It is also possible to set up chat commands in custom single-player maps. Best maps selection has been updated for each category (in a way so new & good maps will be getting higher chances to appear there). New features can be seen in 3 recent open source maps by <a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"https://www.plazmaburst2.com/?a=&s=7&ac=Eric%20Gurt&id=5\">Eric Gurt</a>."],"5":["1 April 2018: "," Good Morning and happy Easter (if you celebrate) / April fools! If you haven't already be sure to check out Multiplayer! We've hidden other fun Easter eggs around the site, so be sure to find them all!"],"6":["8 February 2018: "," Plazma Burst 2 has been updated to version 1.28! Updated with your highly rated fan art suggestions and tweaks you mentioned on our forums & few more options for custom level designers. We would like to thank everyone who voted & participated in discussing (v1.28) on the forums. Without your constant love and support for the PlazmaBurst Series, PlazmaBurst wouldn't be the game it is today with FanArt, League players, Competitive players, Level Designers and players who just love PlazmaBurst. To everyone, we'd like to again say thank you and enjoy (v1.28) <br><br>"]},"6":{"0":["2 February 2018: "," (v1.28) Demo of upcoming Plazma Burst 2 update can be seen here <a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"https://www.plazmaburst2.com/?s=2&experimental=1&map=eric%20gurt-testtest\">Click</a>. Please give us feedback / report any bugs or tweaks that we need to make <a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"https://www.plazmaburst2.com/forum/viewtopic.php?f=146&t=20924\">here on the forums</a>."],"1":["15 January 2018: "," We have started <a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"/fanart.php\">polls on fan art submissions</a>. Feel free to choose what you want to see in next Plazma Burst 2 update."],"2":["8 January 2018: "," Game was updated. Scoreboard can show up to 16 players now; New Star Defender-styled skin, decoration, backgrounds, weapons added; New trigger action types for Level Editor; Unexpected explosion behavior as well as memory leaks in Multiplayer been fixed. Also, keep in mind we'll be adding some of player-suggested fan-art - make sure you submit yours <a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"/forum/viewtopic.php?f=167&t=20678\">here</a> before 15 January."],"3":["1st January 2018: "," Season 2 Plazma League has officially started, you can sign up <a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"/forum/viewtopic.php?f=128&t=20646\">here</a> on the forums. You can find more information regarding how the event is run <a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"/forum/viewtopic.php?f=128&t=20645\">here</a>. Happy New Years and hope you join! Contact <a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"/?a=&s=7&ac=Sparken&id=1272142\">Sparken</a> for any additional questions."],"4":["17 December 2017: "," Season 1 Plazma League has officially come to an end. Season 2 will begin in January 2018, more information will be released on the forum regarding sign ups as we get closer. Thank you for all the people who participated in season 1, I hope to see you next season."],"5":["29 November 2017: "," Support for few more new Trigger action types was added in Advanced Level Editor."],"6":["13 November 2017: "," Plazma League has officially got it's own top 20 table along with rewards. The way this works, you must achieve top 3 by the end of the season to be given your award. Awards are given after all regular/league matches are finished and that will be the final standings for top 20. Once a new season begins, then the top 20 list will be emptied and participants will have a chance to gain on it. <br><br>To get on top 20, you need to earn points. There are several ways of earning points for example getting specific amount of points. As of right now since season 1 has finished, there will be discussions held regarding how season 2 point system will work for the top 20. More information will be released soon. Got any questions? Message me on my <a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"/?a=&s=7&ac=Sparken&id=1272142\">Sparken</a> account.<br><br>"]},"7":{"0":["17 September 2017: "," Plazma League is one of the first competitive competitions being introduced to the PB2 community. Our number one priority is to ensure the players enjoy themselves and bring back the competition and thrill back into the community. Please contact <a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"/?a=&s=7&ac=Sparken&id=1272142\">Sparken</a> for more information regarding the event. <a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"/forum/viewtopic.php?f=128&t=20026\">Here is the link to the topic of a more detailed explanation how the event works</a>."],"1":["15 March 2017: "," Fixed Advanced Level Editor lag which been present during working with medium and big maps in Mozilla Firefox."],"2":["10 January 2017: "," Few optimizations been implemented in order to speed up gore effects rendering in Plazma Burst 2; few new trigger action types for singleplayer & engine marks for multiplayer deathmatch modes been added; players in approved maps spawn with up to 3 weapons now; increased player speed when crouching; blood does not disappear as fast during 60 FPS framerate setting."],"3":["27 August 2016: ","<a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"https://plazmaburst.miraheze.org/wiki/Main_Page\">Wiki</a> link been added to site sections."],"4":["29 January 2016: "," We have a <a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"?s=11&a=\">Chat</a>."],"5":["17 December 2015: "," In case if you can't access your account - contact eric@gevanni.com using your account's e-mail address."],"6":["21 October 2015: "," We have decided to revert back to the old PB2 forums until PB2.5. PB2.5's release date is not anytime soon. So for the time being we will stick with PB2's forum. Thank you, The Support Team of PlazmaBurst<br><br>"]},"8":{"0":["10 October 2015: ","We believe it is necessary to remove the chat from the website due to constant drama on the chat. When the chat was first implemented into the site, it's purpose was to bring the community together and discuss Plazma Burst game. We believe the chat has drifted away from it's purpose and we have decided it's time to turn it off.<br>Thank you for your understanding. ~The support team of Plazma Burst 2 website"],"1":["14 September 2015: ","The community forums will be down for a short time while essential maintenance takes place. ~The support team of Plazma Burst 2 website"],"2":["6 September 2015: ","Something new? <a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"https://www.twitter.com/Eric_Gurt\">www.twitter.com/Eric_Gurt</a>."],"3":["15 August 2015: ","Ranking algorithms have been changed. Predicted Player Points amount will only change for players who have PPP difference under 1. More information <a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"http://www.plazmaburstforum.com/viewtopic.php?f=19&t=1972\">here</a>."],"4":["30 July 2015: ","Submit your artwork for PlazmaBurst!<br>Submit a new player skin or pistol, maybe a new sniper rifle or how about a new grenade? You are in control. Your submission has the possibility to be added to the (Link Removed)."],"5":["1 June 2015: ","We are hosting a new official event on the (link Removed), Do you have what it takes to be a legendary map maker? Join us!"],"6":["18 May 2015: ","We have updated the forum and it's now public! Click (link Removed) to be taken to the forum!<br><br>"]},"9":{"0":["20 February 2015: ","We are pleased to announce we have moved our forum to a new host! Click (Link Removed) to be taken to the forum!"],"1":["17 February 2015: ","We are pleased to announce that we have a community <a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"https://www.facebook.com/pages/PlazmaBurst/672224132887485\">Facebook</a> page!"],"2":["16 February 2015: ","We got problems with site database - some player accounts were lost but we are trying to restore as much as possible. Contact eric@gevanni.com in case if important data was lost and you need it's restore."],"3":["6 February 2015: ","Recently active players amount instead of total number of connections is displayed during server pick now; stats added to site <a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"?s=2\">Play</a> section under game screen."],"4":["23 January 2015: ","Ranking and Player Points will remain frozen because we noticed that site Player Points system becomes more abused with boosting/farming. In order to configure Player Points-based system to ignore boosting/farming (instead of hunting up players which are doing this) this will continue.<br>Keep on trying different strategies to gain Predicted Player Points so we can configure Player Points system faster and unfreeze ranking."],"5":["15 December 2014: ","Multiplayer ranking algorithms changed; ranking is temporary frozen; <a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"?s=18\">polls page</a> has new question related to custom maps ranking; instant demo link for published maps has been added."],"6":["12 December 2014: ","<a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"?s=18\">Polls page</a> has new question related to multiplayer ranking.<br><br>"]},"10":{"0":["19 September 2014: ","Server perfomance improvement update."],"1":["6 September 2014: ","New trigger types for Advanced Level Editor. More you can see in map: eric gurt-test16."],"2":["3 September 2014: ","ScaleSelection has been added to Advanced Level Editor."],"3":["26 August 2014: ","New trigger types for Advanced Level Editor. More you can see in map: eric gurt-test14."],"4":["6 August 2014: ","Top 100 ranking unfrozen; Profile pages updated."],"5":["10 July 2014: ","Top 100 ranking changed; Ranking is based on activity in multiplayer Ranked Matches and competitive skill now. Player Points represent an average value over time. Check FAQ page for revelant information on Player Points."],"6":["30 June 2014: ","Level Editor Manual updated - now reflects information for Level Editor v1.1. Accessible from Advanced Level Editor v1.1.<br><br>"]},"11":{"0":["23 May 2014: ","Small improvements."],"1":["15 May 2014: ","Game updated to avoid few bugs during campaign mode; small performance and AI tweaks."],"2":["8 May 2014: ","Now game save data will be stored at both client and server-side as aligned to account. This way all you need to move from one computer to another - log-into your site account. This also may solve all possible problems when players were losing campaign progress for few reasons.<br>Also we start monitoring site performance to understand site availability issues. As second step we will start monitoring servers performance.<br><br>All updates:<br>- Keyword-based indexing. All maps now need keywords in order to be properly displayed in search results;<br>- Game updated and will store game progress data at your site profile;<br>- Anti-reconnect time decreased;<br>- We working on site and servers performance."],"3":["8 April 2014: ","Game Master feature will be disabled as default soon (in order to be Game Master you will need to start private match)."],"4":["7 April 2014: ","Servers updated; fixed vote kick blocking for alias accounts; guests can join approved maps without delay."],"5":["4 April 2014: ","Non-active players are lowered down in TOP 100."],"6":["2 February 2014: ","New Engine Marks, Trigger action types were added to Advanced Level Editor; game updated.<br><br>"]},"12":{"0":["18 December 2013: ","Snow performance improved; shotgun bullet scatter is more uniform."],"1":["5 December 2013: ","Small bug fixes; FAQ page updated with information to solve problems for players who using wi-fi connection."],"2":["18 November 2013: ","Player Points descreasing problem fixed."],"3":["16 November 2013: ","Inactive accounts will lose x3 times more PP daily. FAQ page updated with this information."],"4":["31 October 2013: ","Technical problems with website which can show 450 error to our players. Problem solved."],"5":["16 October 2013: ","Game updated. Small bug fixes."],"6":["5 October 2013: ","Videos section updated.<br><br>"]},"13":{"0":["4 August 2013: ","Improved hitboxes; overboost bug removed (which taken place during 60 FPS and low physics setting); fixed climbing bug; removed bug when fall damage was decreased due to 25 FPS setting; new trigger type."],"1":["17 July 2013: ","Map source sharing."],"2":["16 July 2013: ","Now we have <a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"forum/pb_login.php\">Plazma Burst 2 official forum</a>."],"3":["13 July 2013: ","Update almost complete. Here is a list of what was changed or added:<br><br>Game:<br>- New intro screen;<br>- Changes in game's interface;<br>- New materials, triggers, backgrounds and characters;<br>- New Advanced Level Editor which is in Beta state (not stable, works only for webkit-based web browsers like Apple Safari, Google Chrome, Opera Next, Maxthon). New Level Editor will replace default;<br>- Optimizations (including map loading speed optimization, collision optimization and other);<br>- Game framerate can be changed now;<br>- Eliminated problem when same event was sending twice to same client (ex. in previous game version frag message appeared twice sometimes, nade thrown twice instead);<br>- Players will respawn faster in TDM mode where online players count less or equal to 4;<br>- Mouse events overflow is fixed (in-game cursor will no longer remain behind real position);<br>- Adaptation for OS X computers;<br>- Mouse wheel fixed for recent browsers and can be disabled in game \"Settings & Performance\";<br>- Added option \"Screen Effects Quality\" which enables full screen damage indication;<br>- Movable objects are now recognized as slopes;<br>- Added \"Portable Shield v07 CS-Quarium\" for multiplayer;<br>- \"Impossible\" difficulty for singleplayer mode;<br>- Snow;<br>- Added \"Ray Rifle TCoRR\" from PB:FTP;<br>- Team chat;<br>- Bug fixes (including respawn problem in TDM mode, problem when player was visible after disconnection);<br>- \"Clear all save data\" button was moved to \"Settings & Performance\";<br>- Information on error is more detailed;<br>- Valid position of ragdolls and characters in unstable state (multiplayer).<br><br>New Level Editor (Beta):<br>- Horizontal mirroring of selection (H);<br>- Vertical mirroring of selection (V);<br>- Copy selection to main clipboard (Ctrl+C);<br>- Paste selection from main clipboard (Ctrl+V);<br>- Copy selection to any secondary clipboard (Ctrl+1, Ctrl+2, Ctrl+3, Ctrl+4, Ctrl+5, Ctrl+6, Ctrl+7, Ctrl+8, Ctrl+9);<br>- Paste selection from any secondary clipboard (1, 2, 3, 4, 5, 6, 7, 8, 9);<br>- New Level Editor v1.1 will not work properly with maps created with old Level Editor v0.9 (every connection between triggers, timers, death events will be messed);<br>- Some of Trigger actions are not working;<br>- Map can become empty after save operation in some cases (consider making of backups for important maps). Old and new Level Editors are using different save files for the same map. New Level Editor can't modify save file of old Level Editor, but old Level Editor will replace save file of new Level Editor..<br><em>In case of detection problems with new Level Editor - feel free to send reports to Eric Gurt (eric |at| gevanni.com).</em><br><br>Multiplayer & Ranking:<br>- Multiplayer matches list is separated into 3 groups:<br>   • Ranked matches - approved maps in ranked mode. These matches can make influence on player's stats including Player Points.<br>   • Training matches - approved maps in unranked mode. These matches can make influence on player's stats excluding Player Points. <br>   • Custom maps - maps created by community and not approved (yet) for ranked matches. These matches do no influence on player's stats. <br>- Game masters no longer exist for approved ranked matches;<br>- Ranked matches always have ping limit 165;<br>- Kick voting is silent now, never ends and does not blocking other votings;<br>- Multiplayer maps now support Enemies and Barrels;<br>- Guests can't join ranked matches;<br>- Improved fariness of gameplay;<br>- Ranking is now based on Player Points. Single frag can give or substract no more than 2% of player's current points ammount. Player with ammount of points under 10 can gain points easier;<br>- Player Points value will go down by 1% every day (temporary)."],"4":["10 July 2013: ","Game & Server are updating."],"5":["22 June 2013: ","TOP 100 players sorting is now based on Player Points. Old rank is added to Player Points. Player Points value will go down by 0.5% every day. Rewarding is still frozen."],"6":["15 March 2013: ","Some plans regarding ranking changes, you can help us by <a onClick=\"event.preventDefault ? event.preventDefault() : event.returnValue = false; window.external.PopUpLink( this.href ); return false;\" target=\"_blank\" href=\"?s=18\">voting here</a>.<br><br>"]},"14":{"0":["13 March 2013: ","Player rank estimation algorithms will change for TOP 100 Best Players soon; latest k/d ratio is now displayed in profile; site section with only chat."],"1":["31 January 2013: ","Site functions related to personal messages, lists of friends and enemies, comments for maps may be temporarily unavailable due to maintenance work."],"2":["24 March 2009: ","Hey, you've reached the very end! <span class=\"spanlink\" onclick=\"window.external.RunGame('plazma_burst_fttp.swf');\">Play Plazma Burst: Forward to the Past</span>? (will only run in standalone launcher)<br><br>"]}}